Exercise with csv

In [1]:
import pandas as pd

In [25]:
df = pd.read_csv("data/ex2.csv", sep=',',header=None)
df

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [29]:
#let's specify the header
names = ['a', 'b', 'c', 'd','message']
pd.read_csv('data/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [31]:
#we can specify the lines that shouldn't be in the dataframe

pd.read_csv("data/ex4.csv", skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [33]:
import numpy as np
string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [35]:
#remove missing number
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [36]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [37]:
data.notnull()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [52]:
data1 = pd.DataFrame([[1., 6.5, 3.], [3, 5., 9, 32] ,[1, 5 , np.nan, np.nan], [np.nan, 4, 6 ,np.nan]])
data1

     0    1    2     3
0  1.0  6.5  3.0   NaN
1  3.0  5.0  9.0  32.0
2  1.0  5.0  NaN   NaN
3  NaN  4.0  6.0   NaN

In [46]:
data1.dropna(inplace=True)
data1

     0    1    2     3
1  3.0  5.0  9.0  32.0

In [49]:
data1.dropna(axis=1, inplace=True)
data1

     1
0  6.5
1  5.0
2  5.0
3  4.0

In [54]:
#data.dropna(how='all')
data1.dropna(how='any')

     0    1    2     3
1  3.0  5.0  9.0  32.0

In [ ]:
#delete the lines that have atleast 2 nan
df.dropna(tresh=2)